diplom-src/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ОтпускаСотрудников</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщееКоличествоДнейОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДнейОтпускаПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

 &НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	
	ЗаполнитьОбщееКоличествоДнейОтпуска();
	ЗаполнитьКоличествоДнейОтпускаПлан();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)

	ЗаполнитьОбщееКоличествоДнейОтпуска();
	ЗаполнитьКоличествоДнейОтпускаПлан();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьАнализГрафика(Команда)
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика");
	
	Адрес = ЗаписатьВХранилище();
    Оповестить("Адрес", Адрес,);
    Закрыть(Адрес);
		
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьОбщееКоличествоДнейОтпуска()
	
	Строка = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	ЗаполнитьОбщееКоличествоДнейОтпускаСотрудника(Строка.Сотрудник);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОбщееКоличествоДнейОтпускаСотрудника(Сотрудник)
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Сотрудник", Сотрудник);
	
	ТабЧасть = Объект.ОтпускаСотрудников.НайтиСтроки(СтруктураОтбора);
	
	КоличествоДней = 0;
	Для Каждого Стр из ТабЧасть Цикл
		КоличествоДней = КоличествоДней + ((Стр.ДатаОкончания - Стр.ДатаНачала) / 86400);
	КонецЦикла;
	
	Для Каждого Стр из ТабЧасть Цикл
		Стр.ОбщееКоличествоДнейОтпуска = КоличествоДней;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКоличествоДнейОтпускаПлан()
	
	Строка = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	Строка.КоличествоДнейОтпускаПлан = (Строка.ДатаОкончания - Строка.ДатаНачала) / 86400;
			
КонецПроцедуры

&НаСервере
Функция ЗаписатьВХранилище()
	
	ТабЧасть = Объект.ОтпускаСотрудников.Выгрузить();
	Возврат ПоместитьВоВременноеХранилище(ТабЧасть);
	
КонецФункции

#КонецОбласти
